app/views/events/show.html.erb

SELECT "companies".* FROM "companies" WHERE "companies"."event_id" = ? ORDER BY "companies"."name" ASC  [["event_id", 7]]
---
    <div class="ui list">
        <% @event.companies.order(:name).each do |company| %>