app/views/companies/show.html.erb

            <% @requests.each do |request| %>
                <div class="ui item"><%= request.user.first_name %> <%= request.user.last_name%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]