app/controllers/companies_controller.rb

    def create
        @company = @event.companies.create(company_params)
---
INSERT INTO "companies" ("name", "link", "summary", "slug", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Amazon"], ["link", ""], ["summary", ""], ["slug", "amazon"], ["event_id", 7], ["created_at", "2019-07-26 19:22:57.365961"], ["updated_at", "2019-07-26 19:22:57.365961"]]

    def set_event
        @event = Event.find_by(slug: params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."slug" = ? LIMIT ?  [["slug", "siwintercareerfair"], ["LIMIT", 1]]

    def set_company
        @company = @event.companies.find_by(slug: params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."event_id" = ? AND "companies"."slug" = ? LIMIT ?  [["event_id", 7], ["slug", "amazon"], ["LIMIT", 1]]