app/controllers/events_controller.rb

  def index
    if !current_user
        redirect_to login_path
    end

    @events = Event.all
---
SELECT "events".* FROM "events"

  def create
    @event = Event.new(event_params)

    @event.save
---
INSERT INTO "events" ("name", "location", "link", "description", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def set_event
    @event = Event.find_by(slug: params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."slug" = ? LIMIT ?  [["slug", "si"], ["LIMIT", 1]]