app/controllers/requests_controller.rb

  def destroy
    @event = Event.find_by(slug: params[:event_id])
    @company = @event.companies.find_by(slug: params[:company_id])
---
SELECT  "events".* FROM "events" WHERE "events"."slug" = ? LIMIT ?  [["slug", "siwintercareerfair"], ["LIMIT", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."event_id" = ? AND "companies"."slug" = ? LIMIT ?  [["event_id", 7], ["slug", "amazon"], ["LIMIT", 1]]